---
kind: method
id: M:Autodesk.Revit.DB.TessellatedShapeBuilder.CloseConnectedFaceSet
source: html/0bebb71c-317e-3dbc-1304-169561e22214.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.CloseConnectedFaceSet Method

Closes the currently open connected face set.

## Syntax (C#)
```csharp
public void CloseConnectedFaceSet()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - A face set is empty and cannot be closed until some faces are added.